Revit 2024 API
Wave.WavePhase Property
 The property labeled "Phase" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WavePhase { get; }
Visual Basic
Public Shared ReadOnly Property WavePhase As String
	Get
Visual C++
public:
static property String^ WavePhase {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 10000".
See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace